       IDENTIFICATION DIVISION.
       PROGRAM-ID.    EX03.
       AUTHOR.        LUCAS SILVA.
       DATE-WRITTEN.  2025-10-31.
       DATE-COMPILED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADENT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT ARQSOR ASSIGN TO DISK.
           SELECT CADSAI ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD CADENT
           LABEL RECORD ARE STANDARD 
           VALUE OF FILE-ID IS "CADENT.TXT".

       01 REG-CADENT.
           02 COD-ENT PIC 9(05).
           02 NOM-ENT PIC X(30).
           02 DEP-ENT PIC 9(01).

       SD ARQSOR. 
       01 REG-SOR.
           02 COD-SOR PIC 9(05).
           02 NOM-SOR PIC X(30).
           02 DEP-SOR PIC 9(01).

       FD CADSAI
           LABEL RECORD ARE STANDARD 
           VALUE OF FILE-ID IS "CADSAI.TXT".

       01 REG-CADSAI.
           02 COD-SAI PIC 9(05).
           02 NOM-SAI PIC X(30).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
       EM03-EX03.
       SORT ARQSOR
           ASCENDING KEY COD-SOR
           USING CADENT
           OUTPUT PROCEDURE SOR-ROT.
       STOP RUN.

       SOR-ROT SECTION.
           PERFORM INICIO.
           PERFORM PRINCIPAL
               UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM.

       INICIO SECTION.
           OPEN INPUT CADENT.
           OPEN OUTPUT CADSAI.
           PERFORM LE-SORT.

       LE-SORT SECTION.
           RETURN ARQSOR INTO REG-SOR
               AT END
               MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL SECTION.
           PERFORM SELECAO.
           PERFORM LE-SORT.

       SELECAO SECTION.
           IF DEP-SOR EQUAL 1 OR 2 THEN
           PERFORM GRAVACAO.

       GRAVACAO SECTION.
           MOVE COD-SOR TO COD-SAI
           MOVE NOM-SOR TO NOM-SAI
           WRITE REG-CADSAI.

       FIM SECTION.
           CLOSE CADSAI.
