       IDENTIFICATION DIVISION.
       PROGRAM-ID.    EX03.
       AUTHOR.        LUCAS SILVA.
       DATE-WRITTEN.  2025-10-31.
       DATE-COMPILED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADENT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADSAI ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD CADENT
           LABEL RECORD ARE STANDARD 
           VALUE OF FILE-ID IS "CADENT.TXT".

       01 REG-CADENT.
           02 COD-ENT PIC 9(05).
           02 NOM-ENT PIC X(30).
           02 DEP-ENT PIC 9(02).

       FD CADSAI 
           LABEL RECORD ARE STANDARD 
           VALUE OF FILE-ID IS "CADSAI.TXT".

       01 REG CADSAI.
           02 COD-SAI PIC 9(05).
           02 NOM-SAI PIC X(30).
       PROCEDURE DIVISION.