       IDENTIFICATION DIVISION.
       PROGRAM-ID.   EX04.
       AUTHOR.       LUCAS SILVA.
       DATE-WRITTEN. 2025-11-09.
       DATE-COMPILED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADCLIENTE ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT ARQSOR ASSIGN TO DISK.
           SELECT RELAT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD CADCLIENTE
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADCLI.TXT".
       01 REG-CLI.
           02 COD-CLI PIC 9(03).
           02 CPF-CLI PIC 9(11).
           02 NOM-CLI PIC X(30).
           02 EST-CLI PIC X(02).
           02 CID-CLI PIC X(30).
           02 EMA-CLI PIC X(30).

       SD ARQSOR.
       01 REL-SOR.
           02 COD-SOR PIC 9(03).
           02 CPF-SOR PIC 9(11).
           02 NOM-SOR PIC X(30).
           02 EST-SOR PIC X(02).
           02 CID-SOR PIC X(30).
           02 EMA-SOR PIC X(30).
       
       FD RELAT 
           LABEL RECORD IS OMITTED.
       01 REG-REL PIC X(80).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ PIC X(03) VALUE "NAO".
       77 CONT-PG PIC 9(02) VALUE ZEROS.
       77 CONT-LIN PIC 9(02) VALUE 21.

       01 CAB-01.
           02 FILLER PIC X(13) VALUE SPACES.
           02 FILLER PIC X(37) 
           VALUE "RELACAO DE CLIENTES POR ESTADO/CIDADE".
           02 FILLER PIC X(23) VALUE SPACES.
           02 FILLER PIC X(05) VALUE "PAG. ".
           02 VAR-PAG PIC Z9.

       01 CAB-02.
           02 FILLER PIC X(08) VALUE "ESTADO: ".
           02 VAR-EST PIC X(02).
           02 FILLER PIC X(70) VALUE SPACES.

       01 CAB-03.
           02 FILLER PIC X(08) VALUE "CIDADE: ".
           02 VAR-CID PIC X(30).
           02 FILLER PIC X(42) VALUE SPACES.

       01 CAB-04.
           02 FILLER PIC X(03) VALUE "CPF".
           02 FILLER PIC X(20) VALUE SPACES.
           02 FILLER PIC X(04) VALUE "NOME".
           02 FILLER PIC X(33) VALUE SPACES.
           02 FILLER PIC X(05) VALUE "EMAIL".

       01 DETALHE.
           02 VAR-CPF PIC 9(11).
           02 FILLER PIC X(05) VALUE SPACES.
           02 VAR-NOM PIC X(30).
           02 FILLER PIC X(04) VALUE SPACES.
           02 VAR-EMA PIC X(30).


       PROCEDURE DIVISION.
       EM03-EX04.
       SORT ARQSOR
           ASCENDING KEY CPF-SOR
           USING CADCLIENTE
           OUTPUT PROCEDURE SOR-ROT.
       STOP RUN.

       SOR-ROT SECTION.
           PERFORM INICIO.
           PERFORM PRINCIPAL
               UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM FIM.

       INICIO SECTION.
           OPEN OUTPUT RELAT.
           PERFORM LE-SORT.
           MOVE CID-SOR TO VAR-CID.
           MOVE EST-SOR TO VAR-EST.
       
       LE-SORT SECTION.
           RETURN ARQSOR INTO REL-SOR
               AT END
               MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL SECTION.
           PERFORM IMPRESSAO.
           PERFORM IMPDET.
           PERFORM LE-SORT.

       IMPRESSAO SECTION.
           IF CONT-LIN GREATER THAN 20
               PERFORM CABECALHO.

       IMPDET SECTION.
           MOVE CPF-SOR TO VAR-CPF.
           MOVE NOM-SOR TO VAR-NOM.
           MOVE EMA-SOR TO VAR-EMA.
           WRITE REG-REL FROM DETALHE AFTER ADVANCING 1 LINE.
           ADD 1 TO CONT-LIN.

       CABECALHO SECTION.
           ADD 1 TO CONT-PG.
           MOVE CONT-PG TO VAR-PAG.
           MOVE SPACES TO REG-REL.
           WRITE REG-REL AFTER ADVANCING PAGE.
           WRITE REG-REL FROM CAB-01 AFTER ADVANCING 1 LINE.
           WRITE REG-REL FROM CAB-02 AFTER ADVANCING 1 LINE.
           WRITE REG-REL FROM CAB-03 AFTER ADVANCING 1 LINE.
           WRITE REG-REL FROM CAB-04 AFTER ADVANCING 1 LINE.
           MOVE ZEROS TO CONT-LIN.

       FIM SECTION.
           CLOSE RELAT.